# Solutions

1. [Series Attributes and Statistical Methods](#1.-Series-Attributes-and-Statistical-Methods)
1. [Series Methods More](#2.-Series-Methods-More)
1. [Series Methods More II](#3.-Series-Methods-More-II)
1. [String Series Methods](#4.-String-Series-Methods)
1. [Datetime Series Methods](#5.-Datetime-Series-Methods)
1. [DataFrame Attributes and Methods](#6.-DataFrame-Attributes-and-Methods)
1. [DataFrame Descriptive Statistic Methods](#7.-DataFrame-Descriptive-Statistic-Methods)
1. [DataFrame Methods More](#8.-DataFrame-Methods-More)
1. [DataFrame Methods More II](#9.-DataFrame-Methods-More-II)
1. [Changing Data Types](#10.-Changing-Data-Types)
1. [Assigning Subsets of Data](#11.-Assigning-Subsets-of-Data)

## 1. Series Attributes and Statistical Methods

In [1]:
import pandas as pd
import numpy as np

### Exercise 1
<span  style="color:green; font-size:16px">Read in the movie dataset with the title as the index and assign the `imdb_score` as a Series to variable `score`. Output the first 5 values.</span>

In [2]:
movie = pd.read_csv('../data/movie.csv', index_col='title')
movie.head()

,year,color,content_rating,duration,director_name,director_fb,actor1,actor1_fb,actor2,actor2_fb,...,actor3_fb,gross,genres,num_reviews,num_voted_users,plot_keywords,language,country,budget,imdb_score
title,,,,,,,,,,,,,,,,,,,,,
Avatar,2009.0,Color,PG-13,178.0,James Cameron,0.0,CCH Pounder,1000.0,Joel David Moore,936.0,...,855.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,723.0,886204,avatar|future|marine|native|paraplegic,English,USA,237000000.0,7.9
Pirates of the Caribbean: At World's End,2007.0,Color,PG-13,169.0,Gore Verbinski,563.0,Johnny Depp,40000.0,Orlando Bloom,5000.0,...,1000.0,309404152.0,Action|Adventure|Fantasy,302.0,471220,goddess|marriage ceremony|marriage proposal|pi...,English,USA,300000000.0,7.1
Spectre,2015.0,Color,PG-13,148.0,Sam Mendes,0.0,Christoph Waltz,11000.0,Rory Kinnear,393.0,...,161.0,200074175.0,Action|Adventure|Thriller,602.0,275868,bomb|espionage|sequel|spy|terrorist,English,UK,245000000.0,6.8
The Dark Knight Rises,2012.0,Color,PG-13,164.0,Christopher Nolan,22000.0,Tom Hardy,27000.0,Christian Bale,23000.0,...,23000.0,448130642.0,Action|Thriller,813.0,1144337,deception|imprisonment|lawlessness|police offi...,English,USA,250000000.0,8.5
Star Wars: Episode VII - The Force Awakens,NaN,NaN,NaN,NaN,Doug Walker,131.0,Doug Walker,131.0,Rob Walker,12.0,...,NaN,NaN,Documentary,NaN,8,NaN,NaN,NaN,NaN,7.1

In [3]:
score = movie['imdb_score']
score.head()

title
Avatar                                        7.9
Pirates of the Caribbean: At World's End      7.1
Spectre                                       6.8
The Dark Knight Rises                         8.5
Star Wars: Episode VII - The Force Awakens    7.1
Name: imdb_score, dtype: float64

### Exercise 2
<span  style="color:green; font-size:16px">What is the data type of `score` and how many values does it contain?</span>

In [4]:
score.dtype

dtype('float64')

In [5]:
score.size

4916

Or use the `len` method

In [6]:
len(score)

4916

### Exercise 3
<span  style="color:green; font-size:16px">What is the maximum and minimum score?</span>

In [7]:
score.max()

9.5

In [8]:
score.min()

1.6

### Exercise 4
<span  style="color:green; font-size:16px">How many missing values are there in the `score`?</span>

In [9]:
score.isna().sum()

0

### Exercise 5
<span  style="color:green; font-size:16px">Read he docstrings on how the `rank` method works and then rank the first 10 values in `score` from highest to lowest.</span>

In [10]:
score.head(10).rank(ascending=False)

title
Avatar                                         2.0
Pirates of the Caribbean: At World's End       6.5
Spectre                                        8.0
The Dark Knight Rises                          1.0
Star Wars: Episode VII - The Force Awakens     6.5
John Carter                                    9.0
Spider-Man 3                                  10.0
Tangled                                        3.0
Avengers: Age of Ultron                        4.5
Harry Potter and the Half-Blood Prince         4.5
Name: imdb_score, dtype: float64

Can also assign the head to a variable and then call `rank`.

In [11]:
score_head = score.head(10)

In [12]:
score_head.rank()

title
Avatar                                         9.0
Pirates of the Caribbean: At World's End       4.5
Spectre                                        3.0
The Dark Knight Rises                         10.0
Star Wars: Episode VII - The Force Awakens     4.5
John Carter                                    2.0
Spider-Man 3                                   1.0
Tangled                                        8.0
Avengers: Age of Ultron                        6.5
Harry Potter and the Half-Blood Prince         6.5
Name: imdb_score, dtype: float64

### Exercise 6
<span  style="color:green; font-size:16px">How many movies have scores greater than 6? (Remember that True/False evaluates to 1/0)</span>

In [13]:
(score > 6).sum()

3368

### Exercise 7
<span  style="color:green; font-size:16px">How many movies have scores greater than 4 and less than 7?</span>

In [14]:
filt1 = score > 4
filt2 = score < 7
filt = filt1 & filt2

filt.sum()

3021

Or in one line of code

In [15]:
((score > 4) & (score < 7)).sum()

3021

### Exercise 8
<span  style="color:green; font-size:16px">Find the difference between the median and mean of the scores.</span>

In [16]:
score.median() - score.mean()

0.16257119609438497

### Exercise 9
<span  style="color:green; font-size:16px">Add 1 to every value of `score` and then calculate the median.</span>

In [17]:
(score + 1).median()

7.6

### Exercise 10
<span  style="color:green; font-size:16px">Calculate the median of `score` and add 1 to this. Why is this value the same as Exercise 9?</span>

In [18]:
score.median() + 1

7.6

### Exercise 11
<span  style="color:green; font-size:16px">Return a Series that has only scores above the 99.9th percentile</span>

In [19]:
filt = score > score.quantile(.999)
score[filt]

title
The Shawshank Redemption    9.3
Towering Inferno            9.5
Dekalog                     9.1
The Godfather               9.2
Kickboxer: Vengeance        9.1
Name: imdb_score, dtype: float64

## 2. Series Methods More

### Exercise 1
<span  style="color:green; font-size:16px">What percentage of actor 1 Facebook likes are missing?</span>

In [20]:
movie = pd.read_csv('../data/movie.csv', index_col='title')
movie.head()

,year,color,content_rating,duration,director_name,director_fb,actor1,actor1_fb,actor2,actor2_fb,...,actor3_fb,gross,genres,num_reviews,num_voted_users,plot_keywords,language,country,budget,imdb_score
title,,,,,,,,,,,,,,,,,,,,,
Avatar,2009.0,Color,PG-13,178.0,James Cameron,0.0,CCH Pounder,1000.0,Joel David Moore,936.0,...,855.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,723.0,886204,avatar|future|marine|native|paraplegic,English,USA,237000000.0,7.9
Pirates of the Caribbean: At World's End,2007.0,Color,PG-13,169.0,Gore Verbinski,563.0,Johnny Depp,40000.0,Orlando Bloom,5000.0,...,1000.0,309404152.0,Action|Adventure|Fantasy,302.0,471220,goddess|marriage ceremony|marriage proposal|pi...,English,USA,300000000.0,7.1
Spectre,2015.0,Color,PG-13,148.0,Sam Mendes,0.0,Christoph Waltz,11000.0,Rory Kinnear,393.0,...,161.0,200074175.0,Action|Adventure|Thriller,602.0,275868,bomb|espionage|sequel|spy|terrorist,English,UK,245000000.0,6.8
The Dark Knight Rises,2012.0,Color,PG-13,164.0,Christopher Nolan,22000.0,Tom Hardy,27000.0,Christian Bale,23000.0,...,23000.0,448130642.0,Action|Thriller,813.0,1144337,deception|imprisonment|lawlessness|police offi...,English,USA,250000000.0,8.5
Star Wars: Episode VII - The Force Awakens,NaN,NaN,NaN,NaN,Doug Walker,131.0,Doug Walker,131.0,Rob Walker,12.0,...,NaN,NaN,Documentary,NaN,8,NaN,NaN,NaN,NaN,7.1

In [21]:
movie['actor1_fb'].isna().mean()

0.0014239218877135883

### Exercise 2
<span  style="color:green; font-size:16px">Use the `notna` method to find the number of non-missing values in the actor 1 Facebook like column. Verify this number is the same as the `count` method.</span>

In [22]:
movie['actor1_fb'].notna().sum()

4909

In [23]:
movie['actor1_fb'].count()

4909

### Exercise 3
<span  style="color:green; font-size:16px">Fill the missing values of `actor1_fb` with the maximum of `actor2_fb`. Save this result to variable `actor1_fb_full`</span>

In [24]:
max_fb2 = movie['actor2_fb'].max()
max_fb2

137000.0

In [25]:
actor1_fb_full = movie['actor1_fb'].fillna(max_fb2)
actor1_fb_full.head()

title
Avatar                                         1000.0
Pirates of the Caribbean: At World's End      40000.0
Spectre                                       11000.0
The Dark Knight Rises                         27000.0
Star Wars: Episode VII - The Force Awakens      131.0
Name: actor1_fb, dtype: float64

### Exercise 4
<span  style="color:green; font-size:16px">Verify the results of Exercise 3 by selecting just the values of `actor1_fb_full` that were filled by `actor2_fb`.</span>

In [26]:
filt = movie['actor1_fb'].isna()
actor1_fb_full[filt]

title
Pink Ribbons, Inc.         137000.0
Sex with Strangers         137000.0
The Harvest/La Cosecha     137000.0
Ayurveda: Art of Being     137000.0
The Brain That Sings       137000.0
The Blood of My Brother    137000.0
Counting                   137000.0
Name: actor1_fb, dtype: float64

In [27]:
movie['actor2_fb'].max()

137000.0

## 3. Series Methods More II

### Exercise 1
<span  style="color:green; font-size:16px">Randomly sample the `actor1_fb` column as a Series with replacement to select three values. Use random state 54321.</span>

In [28]:
movie['actor1_fb'].sample(3, replace=True, random_state=54321)

title
Firestarter          695.0
November             308.0
Waltz with Bashir     56.0
Name: actor1_fb, dtype: float64

### Exercise 2
<span  style="color:green; font-size:16px">How many unique directors are there?</span>

In [29]:
movie['director_name'].nunique()

2397

### Exercise 3
<span  style="color:green; font-size:16px">Select the `year` column, sort it, and drop any duplicates?</span>

In [30]:
movie['year'].sort_values().drop_duplicates()

title
Intolerance: Love's Struggle Throughout the Ages           1916.0
Over the Hill to the Poorhouse                             1920.0
The Big Parade                                             1925.0
Metropolis                                                 1927.0
The Broadway Melody                                        1929.0
Hell's Angels                                              1930.0
A Farewell to Arms                                         1932.0
42nd Street                                                1933.0
It Happened One Night                                      1934.0
Top Hat                                                    1935.0
The Charge of the Light Brigade                            1936.0
The Prisoner of Zenda                                      1937.0
You Can't Take It with You                                 1938.0
Gone with the Wind                                         1939.0
Rebecca                                                    1940.0
How Green Was My Valley                                    1941.0
Bambi                                                      1942.0
A Guy Named Joe                                            1943.0
Bathing Beauty                                             1944.0
The Valley of Decision                                     1945.0
It's a Wonderful Life                                      1946.0
The Lady from Shanghai                                     1947.0
Red River                                                  1948.0
Sands of Iwo Jima                                          1949.0
Annie Get Your Gun                                         1950.0
Show Boat                                                  1951.0
Singin' in the Rain                                        1952.0
Niagara                                                    1953.0
The Egyptian                                               1954.0
Ordet                                                      1955.0
                                                            ...
Phantasm II                                                1988.0
Roger & Me                                                 1989.0
Gremlins 2: The New Batch                                  1990.0
Teenage Mutant Ninja Turtles II: The Secret of the Ooze    1991.0
Unforgiven                                                 1992.0
Nowhere to Run                                             1993.0
Exotica                                                    1994.0
The Scarlet Letter                                         1995.0
Eraser                                                     1996.0
Speed 2: Cruise Control                                    1997.0
Stiff Upper Lips                                           1998.0
Dudley Do-Right                                            1999.0
Center Stage                                               2000.0
Life as a House                                            2001.0
Poolhall Junkies                                           2002.0
Wonderland                                                 2003.0
Hotel Rwanda                                               2004.0
Goal! The Dream Begins                                     2005.0
Just My Luck                                               2006.0
Lucky You                                                  2007.0
Synecdoche, New York                                       2008.0
New in Town                                                2009.0
The Book of Eli                                            2010.0
Soul Surfer                                                2011.0
Man on a Ledge                                             2012.0
The Wolverine                                              2013.0
An American in Hollywood                                   2014.0
The Lovers                                                 2015.0
Pete's Dragon                                              2016.0
Star Wars: Episode VII - The Force Awakens                    NaN
Name: year, Length: 92, dtype: float64

### Exercise 4
<span  style="color:green; font-size:16px">Get the same result as Exercise 3 by dropping duplicates first and then sort. Which method is faster?</span>

Faster to drop duplicates then sort.

In [31]:
%timeit -n 5 movie['year'].drop_duplicates().sort_values()

1.84 ms Â± 332 Âµs per loop (mean Â± std. dev. of 7 runs, 5 loops each)

In [32]:
%timeit -n 5 movie['year'].sort_values().drop_duplicates()

3.89 ms Â± 1.15 ms per loop (mean Â± std. dev. of 7 runs, 5 loops each)

## 4. String Series Methods

### Exercise 1
<span  style="color:green; font-size:16px">Read in the movie dataset and set the title as the index. Assign the actor 1 column to its own Series variable. Make sure to drop missing values from this Series before assigning it.

Which actor 1 has appeared in the most movies? Can you write an expression that returns this actors name as a string?</span>

In [33]:
movie = pd.read_csv('../data/movie.csv', index_col='title')
actor1 = movie['actor1'].dropna()
actor1.value_counts().head()

Robert De Niro    48
Johnny Depp       36
Nicolas Cage      32
Matt Damon        29
J.K. Simmons      29
Name: actor1, dtype: int64

In [34]:
actor1.value_counts().index[0]

'Robert De Niro'

### Exercise 2
<span  style="color:green; font-size:16px">What percent of movies have the top 100 most frequent actor 1's appeared in?</span>

In [35]:
actor1.value_counts(normalize=True).iloc[:100].sum()

0.325117131798737

### Exercise 3
<span  style="color:green; font-size:16px">How many actor 1's have appeared in exactly one movie?</span>

In [36]:
(actor1.value_counts() == 1).sum()

1379

### Exercise 4
<span  style="color:green; font-size:16px">How many actor 1's have more than 3 e's in their name? Output a unique array of just these actor names so we can manually verify them.</span>

In [37]:
filt = actor1.str.count('e') > 3
unique_e = actor1[filt].unique()
unique_e

array(['Jennifer Lawrence', 'Keanu Reeves', 'Seychelle Gabriel',
       'Jeremy Renner', 'Amber Stevens West', 'Peter Greene',
       'Steven Anthony Lawrence', 'Cedric the Entertainer',
       'Sean Pertwee', 'Xander Berkeley', 'Kathleen Freeman',
       'Pierre Perrier', 'Catherine Deneuve', 'George Kennedy',
       'Leighton Meester', 'Steve Guttenberg', 'Emmanuelle Seigner',
       'Jurnee Smollett-Bell', 'Steve Oedekerk',
       'Johannes Silberschneider', 'Bernadette Peters',
       'Jacqueline McKenzie', 'Dee Bradley Baker', 'Jennifer Freeman',
       'Gene Tierney', 'Roscoe Lee Browne', 'Phoebe Legere',
       'Eric Sheffer Stevens', 'Michael Greyeyes', 'Steven Weber',
       'George Newbern', 'Florence Henderson', 'Michelle Simone Miller',
       'Chemeeka Walker', 'Fereshteh Sadre Orafaiy'], dtype=object)

In [38]:
len(unique_e)

35

To be more exact and account for both upper and lowercase letters, use the regular expression, `[eE]`.

In [39]:
filt = actor1.str.count('[eE]') > 3
unique_eE = actor1[filt].unique()
unique_eE

array(['Jennifer Lawrence', 'Keanu Reeves', 'Seychelle Gabriel',
       'Jeremy Renner', 'Amber Stevens West', 'Rupert Everett',
       'Peter Greene', 'Eileen Brennan', 'Steven Anthony Lawrence',
       'Cedric the Entertainer', 'Sean Pertwee', 'Xander Berkeley',
       'Eddie Redmayne', 'Jennifer Ehle', 'Kathleen Freeman',
       'Alden Ehrenreich', 'Pierre Perrier', 'Catherine Deneuve',
       'George Kennedy', 'Leighton Meester', 'Steve Guttenberg',
       'Ernie Reyes Jr.', 'Emmanuelle Vaugier', 'Emmanuelle Seigner',
       'Jurnee Smollett-Bell', 'Steve Oedekerk',
       'Johannes Silberschneider', 'Bernadette Peters',
       'Jacqueline McKenzie', 'Dee Bradley Baker', 'Jennifer Freeman',
       'Eugenio Derbez', 'Gene Tierney', 'Roscoe Lee Browne',
       'Ed Speleers', 'Joe Estevez', 'Phoebe Legere',
       'Eric Sheffer Stevens', 'Michael Greyeyes', 'Steven Weber',
       'George Newbern', 'Florence Henderson', 'Michelle Simone Miller',
       'Chemeeka Walker', 'Fereshteh Sadre Orafaiy'], dtype=object)

In [40]:
len(unique_eE)

45

### Exercise 5
<span  style="color:green; font-size:16px">Get a unique list of all actors that have the name 'Johnson' as part of their name. Note: When using the </span>

In [41]:
filt = actor1.str.contains('Johnson')
actor1[filt].unique()

array(['Don Johnson', 'Dwayne Johnson', 'Richard Johnson', 'Eric Johnson',
       'Bill Johnson', 'Nicole Randall Johnson', 'R. Brandon Johnson'],
      dtype=object)

### Exercise 6
<span  style="color:green; font-size:16px">How many actor 1 names end in 'x'?</span>

In [42]:
actor1.str.endswith('x').sum()

28

### Exercise 7
<span  style="color:green; font-size:16px">The Pandas string methods overlap with the builtin Python string methods. Find all the public method names that are in-common to both. Then find the public methods that are unique to each.</span>

In [43]:
python_str = {method for method in dir(str) if method[0] != '_'}
pandas_str = {method for method in dir(actor1.str) if method[0] != '_'}

In [44]:
python_str & pandas_str

{'capitalize',
 'center',
 'count',
 'encode',
 'endswith',
 'find',
 'index',
 'isalnum',
 'isalpha',
 'isdecimal',
 'isdigit',
 'islower',
 'isnumeric',
 'isspace',
 'istitle',
 'isupper',
 'join',
 'ljust',
 'lower',
 'lstrip',
 'partition',
 'replace',
 'rfind',
 'rindex',
 'rjust',
 'rpartition',
 'rsplit',
 'rstrip',
 'split',
 'startswith',
 'strip',
 'swapcase',
 'title',
 'translate',
 'upper',
 'zfill'}

In [45]:
python_str - pandas_str

{'casefold',
 'expandtabs',
 'format',
 'format_map',
 'isascii',
 'isidentifier',
 'isprintable',
 'maketrans',
 'splitlines'}

In [46]:
pandas_str - python_str

{'cat',
 'contains',
 'decode',
 'extract',
 'extractall',
 'findall',
 'get',
 'get_dummies',
 'len',
 'match',
 'normalize',
 'pad',
 'repeat',
 'slice',
 'slice_replace',
 'wrap'}

## 5. Datetime Series Methods

In [47]:
bikes = pd.read_csv('../data/bikes.csv', parse_dates=['starttime', 'stoptime'])
start = bikes['starttime']

### Exercise 1
<span  style="color:green; font-size:16px">What percentage of bike rides happen in January?</span>

In [48]:
# 2.7%
start.dt.month_name().value_counts(normalize=True).round(3)

August       0.137
July         0.132
September    0.130
June         0.121
October      0.111
May          0.086
November     0.071
April        0.064
December     0.045
March        0.044
February     0.030
January      0.027
Name: starttime, dtype: float64

### Exercise 2
<span  style="color:green; font-size:16px">What percentage of bike rides happen on the weekend?</span>

In [49]:
start.dt.weekday.isin([5, 6]).mean()

0.19692946555131866

Or like this:

In [50]:
(start.dt.weekday > 4).mean()

0.19692946555131866

### Exercise 3
<span  style="color:green; font-size:16px">What percentage of bike rides happen on the last day of the month?</span>

In [51]:
start.dt.is_month_end.mean()

0.031563816406795904

### Exercise 4
<span  style="color:green; font-size:16px">We would expect that the value of the minutes recorded for each starting ride is approximately random. Can you show some data that confirms or rejects this?</span>

The distribution looks quite uniform:

In [52]:
start.dt.minute.value_counts(normalize=True)

12    0.017968
6     0.017928
8     0.017868
18    0.017808
43    0.017629
21    0.017549
10    0.017529
48    0.017509
44    0.017449
15    0.017409
53    0.017349
17    0.017329
37    0.017309
13    0.017289
19    0.017269
33    0.017229
42    0.017229
39    0.017189
24    0.017189
22    0.017110
34    0.017070
29    0.017070
45    0.016950
5     0.016890
36    0.016870
11    0.016870
14    0.016870
49    0.016850
47    0.016830
30    0.016810
16    0.016710
32    0.016670
38    0.016630
1     0.016630
40    0.016531
7     0.016491
2     0.016471
46    0.016471
4     0.016391
23    0.016331
54    0.016311
57    0.016291
3     0.016251
28    0.016091
35    0.016071
59    0.016071
56    0.016031
0     0.015932
58    0.015912
50    0.015872
31    0.015872
55    0.015852
9     0.015812
27    0.015812
41    0.015712
20    0.015612
25    0.015512
52    0.015253
51    0.015213
26    0.014973
Name: starttime, dtype: float64

### Exercise 5
<span  style="color:green; font-size:16px">Assign the length of the ride to `ride_length`. Then find the percentage of rides that lasted longer than 30 minutes.</span>

In [53]:
stop = bikes['stoptime']
ride_length = stop - start

In [54]:
(ride_length.dt.total_seconds() > (60 * 30)).mean()

0.019625067380063487

## 6. DataFrame Attributes and Methods

### Exercise 1
<span  style="color:green; font-size:16px">Select only the float columns from the `college` DataFrame. How many are there?</span>

In [55]:
college = pd.read_csv('../data/college.csv', index_col='instnm')
college.select_dtypes('float').shape

(7535, 20)

There are 20 float columns

### Exercise 2
<span  style="color:green; font-size:16px">When you call the `info` method on a DataFrame, one of the very last items that gets returned is the count of columns for each data type. Can you think of a different combination of Pandas operations that would return this as a Series. Use just one line of code.</span>

In [56]:
college.dtypes.value_counts()

float64    20
object      4
int64       2
dtype: int64

## 7. DataFrame Descriptive Statistic Methods

In [57]:
import pandas as pd
college = pd.read_csv('../data/college.csv', index_col='instnm')
college_race = college.loc[:, 'ugds_white':'ugds_unkn']

movie = pd.read_csv('../data/movie.csv', index_col='title')
pd.options.display.max_columns = 100

### Exercise 1
<span  style="color:green; font-size:16px">Read in the movie dataset and calculate the mean of each actor Facebook like column. Which actor (1, 2, or 3) has the highest mean?</span>

In [58]:
movie = pd.read_csv('../data/movie.csv', index_col='title')
movie.head()

,year,color,content_rating,duration,director_name,director_fb,actor1,actor1_fb,actor2,actor2_fb,actor3,actor3_fb,gross,genres,num_reviews,num_voted_users,plot_keywords,language,country,budget,imdb_score
title,,,,,,,,,,,,,,,,,,,,,
Avatar,2009.0,Color,PG-13,178.0,James Cameron,0.0,CCH Pounder,1000.0,Joel David Moore,936.0,Wes Studi,855.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,723.0,886204,avatar|future|marine|native|paraplegic,English,USA,237000000.0,7.9
Pirates of the Caribbean: At World's End,2007.0,Color,PG-13,169.0,Gore Verbinski,563.0,Johnny Depp,40000.0,Orlando Bloom,5000.0,Jack Davenport,1000.0,309404152.0,Action|Adventure|Fantasy,302.0,471220,goddess|marriage ceremony|marriage proposal|pi...,English,USA,300000000.0,7.1
Spectre,2015.0,Color,PG-13,148.0,Sam Mendes,0.0,Christoph Waltz,11000.0,Rory Kinnear,393.0,Stephanie Sigman,161.0,200074175.0,Action|Adventure|Thriller,602.0,275868,bomb|espionage|sequel|spy|terrorist,English,UK,245000000.0,6.8
The Dark Knight Rises,2012.0,Color,PG-13,164.0,Christopher Nolan,22000.0,Tom Hardy,27000.0,Christian Bale,23000.0,Joseph Gordon-Levitt,23000.0,448130642.0,Action|Thriller,813.0,1144337,deception|imprisonment|lawlessness|police offi...,English,USA,250000000.0,8.5
Star Wars: Episode VII - The Force Awakens,NaN,NaN,NaN,NaN,Doug Walker,131.0,Doug Walker,131.0,Rob Walker,12.0,NaN,NaN,NaN,Documentary,NaN,8,NaN,NaN,NaN,NaN,7.1

actor 1 has the most FB likes.

In [59]:
movie[['actor1_fb', 'actor2_fb', 'actor3_fb']].mean()

actor1_fb    6494.488491
actor2_fb    1621.923516
actor3_fb     631.276313
dtype: float64

It's also a good idea to assign just the actor FB likes to their own DataFrame:

In [60]:
actors_fb = movie[['actor1_fb', 'actor2_fb', 'actor3_fb']]
actors_fb.mean()

actor1_fb    6494.488491
actor2_fb    1621.923516
actor3_fb     631.276313
dtype: float64

### Exercise 2
<span  style="color:green; font-size:16px">Calculate the total Facebook likes of all three actors for each movie</span>

In [61]:
actors_fb.sum(axis='columns').head()

title
Avatar                                         2791.0
Pirates of the Caribbean: At World's End      46000.0
Spectre                                       11554.0
The Dark Knight Rises                         73000.0
Star Wars: Episode VII - The Force Awakens      143.0
dtype: float64

### Exercise 3
<span  style="color:green; font-size:16px">What percentage of movies have more than 10,000 total actor FB likes?</span>

About 30%

In [62]:
(actors_fb.sum(axis='columns') > 10000).mean()

0.2982099267697315

### Exercise 4
<span  style="color:green; font-size:16px">Find the median gross revenue in millions of dollars for the movies that have more than 10,000 total actor FB likes. Do the same for movies with 10,000 or less total actor FB likes.</span>

In [63]:
criteria = actors_fb.sum(axis='columns') > 10000
movie.loc[criteria, 'gross'].median() / 10 ** 6

42.3919155

In [64]:
movie.loc[~criteria, 'gross'].median() / 10 ** 6

16.8157525

### Exercise 5
<span  style="color:green; font-size:16px">From Exercise 4, it appears that movies with more than 10,000 total actor FB likes gross 2.5 times as much. This may be due to the fact that newer movies have more actors that are recognized by FB users. Find the median year produced for both groups.</span>

In [65]:
movie.loc[criteria, 'year'].median()

2006.0

In [66]:
movie.loc[~criteria, 'year'].median()

2005.0

### Exercise 6
<span  style="color:green; font-size:16px">For each movies made in the year 2016, what is the median of the total actor FB likes?</span>

In [67]:
criteria = movie['year'] == 2016
cols = ['actor1_fb', 'actor2_fb', 'actor3_fb']
movie.loc[criteria, cols].sum(axis='columns').median()

3571.5

### Exercise 7
<span  style="color:green; font-size:16px">Write a function that has a single parameter, `year`. Have it return the median of the total actor FB likes for the given year. Test your function with the year 2016 and verify the result with Exercise 6.</span>

In [68]:
def median_fb_likes(year):
    criteria = movie['year'] == year
    cols = ['actor1_fb', 'actor2_fb', 'actor3_fb']
    return movie.loc[criteria, cols].sum(axis='columns').median()

In [69]:
median_fb_likes(2016)

3571.5

### Exercise 8
<span  style="color:green; font-size:16px">Write a loop to print out the year and median total actor FB likes for that year from 1990 to 2016</span>

In [70]:
for year in range(1990, 2017):
    print(year, median_fb_likes(year))

1990 2017.0
1991 2436.0
1992 2147.5
1993 2018.0
1994 2368.5
1995 2612.0
1996 2692.5
1997 1964.0
1998 2482.0
1999 2595.0
2000 2378.0
2001 2424.0
2002 2146.0
2003 2019.0
2004 2298.0
2005 2072.0
2006 2359.0
2007 2002.5
2008 2400.0
2009 2145.0
2010 2411.0
2011 2818.5
2012 2426.0
2013 2420.0
2014 2084.0
2015 2063.0
2016 3571.5

### Exercise 9
<span  style="color:green; font-size:16px">Using the **college** dataset, find the number of non-missing values in each column and again for each row.</span>

In [71]:
college = pd.read_csv('../data/college.csv')

non-missing for each column

In [72]:
college.count()

instnm                7535
city                  7535
stabbr                7535
hbcu                  7164
menonly               7164
womenonly             7164
relaffil              7535
satvrmid              1185
satmtmid              1196
distanceonly          7164
ugds                  6874
ugds_white            6874
ugds_black            6874
ugds_hisp             6874
ugds_asian            6874
ugds_aian             6874
ugds_nhpi             6874
ugds_2mor             6874
ugds_nra              6874
ugds_unkn             6874
pptug_ef              6853
curroper              7535
pctpell               6849
pctfloan              6849
ug25abv               6718
md_earn_wne_p10       6413
grad_debt_mdn_supp    7503
dtype: int64

non-missing values for the rows

In [73]:
college.count(axis='columns').head()

0    27
1    27
2    25
3    27
4    27
dtype: int64

### Exercise 10
<span  style="color:green; font-size:16px">What is the average number of missing values for each row?</span>

In [74]:
college.isna().mean(axis='columns').head(15)

0     0.000000
1     0.000000
2     0.074074
3     0.000000
4     0.000000
5     0.000000
6     0.074074
7     0.074074
8     0.000000
9     0.000000
10    0.000000
11    0.074074
12    0.000000
13    0.074074
14    0.074074
dtype: float64

### Exercise 11
<span  style="color:green; font-size:16px">The `UGDS` column of the college dataset contains the total undergraduate population. What is the least number of colleges it would take to have have a total of more than 5 million students.</span>

In [75]:
ugds_cumsum = college['ugds'].sort_values(ascending=False).cumsum()
ugds_cumsum.head(10)

7116    151558.0
1189    229215.0
793     290685.0
3711    350605.0
3669    408689.0
725     460969.0
3880    510309.0
3765    557250.0
5817    602174.0
1299    646918.0
Name: ugds, dtype: float64

In [76]:
(ugds_cumsum < 5000000).sum() + 1

185

It takes the top 185 colleges (by population) to total more than 5 million students. Let's verify the results:

In [77]:
ugds_sort = college['ugds'].sort_values(ascending=False)

In [78]:
ugds_sort.iloc[:184].sum()

4989478.0

In [79]:
ugds_sort.iloc[:185].sum()

5007289.0

## 8. DataFrame Methods More

In [80]:
import pandas as pd
college = pd.read_csv('../data/college.csv', index_col='instnm')

### Exercise 1
<span  style="color:green; font-size:16px">Find the number of missing values for each row.</span>

In [81]:
college.isna().sum(axis='columns').head(10)

instnm
Alabama A & M University               0
University of Alabama at Birmingham    0
Amridge University                     2
University of Alabama in Huntsville    0
Alabama State University               0
The University of Alabama              0
Central Alabama Community College      2
Athens State University                2
Auburn University at Montgomery        0
Auburn University                      0
dtype: int64

### Exercise 2
<span  style="color:green; font-size:16px">What percentage of rows have more than 5 missing values?</span>

In [82]:
(college.isna().sum(axis='columns') > 5).mean()

0.09011280690112806

### Exercise 3
<span  style="color:green; font-size:16px">How many total missing values are there in the entire DataFrame?</span>

In [83]:
college.isna().sum().sum()

24808

### Exercise 4
<span  style="color:green; font-size:16px">Several of the columns contain binary data (are either 0 or 1). Can you identify the names of these columns?</span>

Start by finding the number of unique values of each column.

In [84]:
col_unique = college.nunique()
col_unique

city                  2514
stabbr                  59
hbcu                     2
menonly                  2
womenonly                2
relaffil                 2
satvrmid               163
satmtmid               167
distanceonly             2
ugds                  2932
ugds_white            4397
ugds_black            3242
ugds_hisp             2809
ugds_asian            1254
ugds_aian              601
ugds_nhpi              363
ugds_2mor              957
ugds_nra               920
ugds_unkn             1517
pptug_ef              3420
curroper                 2
pctpell               4422
pctfloan              4155
ug25abv               4285
md_earn_wne_p10        598
grad_debt_mdn_supp    2038
dtype: int64

Do boolean indexing to select just those that are binary.

In [85]:
col_unique[col_unique == 2]

hbcu            2
menonly         2
womenonly       2
relaffil        2
distanceonly    2
curroper        2
dtype: int64

Can extract the index to get just the names.

In [86]:
col_unique[col_unique == 2].index

Index(['hbcu', 'menonly', 'womenonly', 'relaffil', 'distanceonly', 'curroper'], dtype='object')

### Exercise 5
<span  style="color:green; font-size:16px">Read the documentation on the `dropna` method. What is the shape of the returned DataFrame when called with the defaults? Call it again except only drop rows if `UGDS` is missing. What is the shape of this DataFrame?</span>

In [87]:
college.dropna().shape

(1171, 26)

Pandas forces you to use a list with the **`subset`** parameter. This is unfortunately inconsistent behavior.

In [88]:
college.dropna(subset=['ugds']).shape

(6874, 26)

### Exercise 6
<span  style="color:green; font-size:16px">Create a new boolean column in the college named 'Verbal Higher' that is True for every college that has a higher verbal than math SAT score. Find the mean of this new column. Why does this number look suspiciously low?</span>

In [89]:
college['Verbal Higher'] = college['satvrmid'] > college['satmtmid']

In [90]:
college['Verbal Higher'].mean()

0.048042468480424684

One reason it is so low is that there are mostly missing values for the SAT columns and the comparison operators return False when comparing missing values. Notice that 84% of the values are missing for both SAT columns.

In [91]:
cols = ['satvrmid', 'satmtmid']
college[cols].isna().mean()

satvrmid    0.842734
satmtmid    0.841274
dtype: float64

### Exercise 7
<span  style="color:green; font-size:16px">Find the real percentage of schools with higher verbal than math SAT scores.</span>

Drop the rows with missing SAT values first.

In [92]:
cols = ['satvrmid', 'satmtmid']
sat = college[cols].dropna()
sat.head()

                                     satvrmid  satmtmid
instnm
Alabama A & M University                424.0     420.0
University of Alabama at Birmingham     570.0     565.0
University of Alabama in Huntsville     595.0     590.0
Alabama State University                425.0     430.0
The University of Alabama               555.0     565.0

In [93]:
(sat['satvrmid'] > sat['satmtmid']).mean()

0.30574324324324326

Can also find all those school with equal scores in both subjects.

In [94]:
(sat['satvrmid'] == sat['satmtmid']).mean()

0.08699324324324324

### Exercise 8
<span  style="color:green; font-size:16px">Use the `copy` method to create a new copy of the `college` DataFrame and assign it to variable `college2`. Select all the non-white race columns (`ugds_black` through `ugds_unkn`).  Sum the rows of this DataFrame and assign the result to a variable. Now drop all the non-white race columns from the `college2` DataFrame and assign the result to `college3`. </span>
    
<span  style="color:green; font-size:16px">Use the `insert` method to insert a new column to the right of the `ugds_white` column of the `college3` DataFrame. Name this column `ugds_nonwhite`.</span>

In [95]:
college2 = college.copy()
college2_race = college2.loc[:, 'ugds_black':'ugds_unkn']
college2_race.head()

,ugds_black,ugds_hisp,ugds_asian,ugds_aian,ugds_nhpi,ugds_2mor,ugds_nra,ugds_unkn
instnm,,,,,,,,
Alabama A & M University,0.9353,0.0055,0.0019,0.0024,0.0019,0.0000,0.0059,0.0138
University of Alabama at Birmingham,0.2600,0.0283,0.0518,0.0022,0.0007,0.0368,0.0179,0.0100
Amridge University,0.4192,0.0069,0.0034,0.0000,0.0000,0.0000,0.0000,0.2715
University of Alabama in Huntsville,0.1255,0.0382,0.0376,0.0143,0.0002,0.0172,0.0332,0.0350
Alabama State University,0.9208,0.0121,0.0019,0.0010,0.0006,0.0098,0.0243,0.0137

In [96]:
non_white = college2_race.sum(axis='columns')
non_white.head()

instnm
Alabama A & M University               0.9667
University of Alabama at Birmingham    0.4077
Amridge University                     0.7010
University of Alabama in Huntsville    0.3012
Alabama State University               0.9842
dtype: float64

In [97]:
college3 = college2.drop(columns=college2_race.columns)
college3.head(2)

,city,stabbr,hbcu,menonly,womenonly,relaffil,satvrmid,satmtmid,distanceonly,ugds,ugds_white,pptug_ef,curroper,pctpell,pctfloan,ug25abv,md_earn_wne_p10,grad_debt_mdn_supp,Verbal Higher
instnm,,,,,,,,,,,,,,,,,,,
Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,4206.0,0.0333,0.0656,1,0.7356,0.8284,0.1049,30300,33888,True
University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,11383.0,0.5922,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5,True

In [98]:
college3.insert(11, 'ugds_nonwhite', non_white)

In [99]:
college3.head(2)

,city,stabbr,hbcu,menonly,womenonly,relaffil,satvrmid,satmtmid,distanceonly,ugds,ugds_white,ugds_nonwhite,pptug_ef,curroper,pctpell,pctfloan,ug25abv,md_earn_wne_p10,grad_debt_mdn_supp,Verbal Higher
instnm,,,,,,,,,,,,,,,,,,,,
Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,4206.0,0.0333,0.9667,0.0656,1,0.7356,0.8284,0.1049,30300,33888,True
University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,11383.0,0.5922,0.4077,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5,True

In [100]:
# all in one cell
college2 = college.copy()
college2_race = college2.loc[:, 'ugds_black':'ugds_unkn']
non_white = college2_race.sum(axis='columns')
college3 = college2.drop(columns=college2_race.columns)
college3.insert(11, 'ugds_nonwhite', non_white)
college3.head(2)

,city,stabbr,hbcu,menonly,womenonly,relaffil,satvrmid,satmtmid,distanceonly,ugds,ugds_white,ugds_nonwhite,pptug_ef,curroper,pctpell,pctfloan,ug25abv,md_earn_wne_p10,grad_debt_mdn_supp,Verbal Higher
instnm,,,,,,,,,,,,,,,,,,,,
Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,4206.0,0.0333,0.9667,0.0656,1,0.7356,0.8284,0.1049,30300,33888,True
University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,11383.0,0.5922,0.4077,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5,True

## Use the flights dataset with the remainder of the Exercises

### Exercise 9
<span  style="color:green; font-size:16px">Read in the flights dataset (`flights.csv`) and call `dropna` with the defaults. What kind of DataFrame was returned? Why? Verify that each row has at least one missing value.
</span>

In [101]:
flights = pd.read_csv('../data/flights.csv')

In [102]:
flights.dropna()

Empty DataFrame
Columns: [year, month, day, day_of_week, airline, flight_number, tail_number, origin_airport, destination_airport, scheduled_departure, departure_time, departure_delay, taxi_out, wheels_off, scheduled_time, elapsed_time, air_time, distance, wheels_on, taxi_in, scheduled_arrival, arrival_time, arrival_delay, diverted, cancelled, cancellation_reason, air_system_delay, security_delay, airline_delay, late_aircraft_delay, weather_delay]
Index: []

In [103]:
(flights.isna().sum(axis='columns') > 0).mean()

1.0

### Use the `all` method to verify that all values in a Series are `True`

In [104]:
(flights.isna().sum(axis='columns') > 0).all()

True

### Exercise 10
<span  style="color:green; font-size:16px">Read the `dropna` docs again and keep rows that have at least 28 non-missing values. Verify the results.</span>

In [105]:
flights.dropna(thresh=28).shape

(11685, 31)

In [106]:
(flights.notna().sum(axis='columns') >= 28).sum()

11685

### Exercise 11
<span  style="color:green; font-size:16px">Find the longest `arrival_delay` for every  airline for every month.</span>

In [107]:
cols = ['airline', 'month', 'arrival_delay']
airline_month_delay = flights[cols]
airline_month_delay.sort_values('arrival_delay', ascending=False) \
                   .drop_duplicates(subset=['airline', 'month']).head()

      airline  month  arrival_delay
58188      UA     12         1185.0
32218      AA      7          858.0
5540       F9      2          839.0
37448      DL      8          741.0
179        AA      1          732.0

## 9. DataFrame Methods More II

In [108]:
import pandas as pd
emp = pd.read_csv('../data/employee.csv')
emp.head()

,title,dept,salary,race,gender,hire_date
0,POLICE OFFICER,Houston Police Department-HPD,45279.0,White,Male,2015-02-03
1,ENGINEER/OPERATOR,Houston Fire Department (HFD),63166.0,White,Male,1982-02-08
2,SENIOR POLICE OFFICER,Houston Police Department-HPD,66614.0,Black,Male,1984-11-26
3,ENGINEER,Public Works & Engineering-PWE,71680.0,Asian,Male,2012-03-26
4,CARPENTER,Houston Airport System (HAS),42390.0,White,Male,2013-11-04

### Exercise 1
<span  style="color:green; font-size:16px">How many unique combinations of department and title exist?</span>

In [109]:
len(emp.drop_duplicates(subset=['dept', 'title']))

315

### Exercise 2
<span  style="color:green; font-size:16px">Since only Series methods have a `unique` method, can you think of a creative way of getting the same result as Exercise 1 with the `unique` method?</span>

In [110]:
# concatenate the two columns together to create a Series
dept_title = emp['dept'] + emp['title']
dept_title.head()

0          Houston Police Department-HPDPOLICE OFFICER
1       Houston Fire Department (HFD)ENGINEER/OPERATOR
2    Houston Police Department-HPDSENIOR POLICE OFF...
3               Public Works & Engineering-PWEENGINEER
4                Houston Airport System (HAS)CARPENTER
dtype: object

In [111]:
# Now, use the `unique` method.
len(dept_title.unique())

315

In [112]:
# in one line
len((emp['dept'] + emp['title']).unique())

315

### Exercise 3
<span  style="color:green; font-size:16px">Find the occurrence of all race and gender combinations. For instance, you would return an object that contains the number of 'Hispanic Males', 'Black Females', etc...</span>

In [113]:
race_gender = emp['race'] + ' - ' + emp['gender']
race_gender.head()

0    White - Male
1    White - Male
2    Black - Male
3    Asian - Male
4    White - Male
dtype: object

In [114]:
race_gender.value_counts()

White - Male                522
Black - Male                326
Hispanic - Male             294
Black - Female              216
Hispanic - Female           101
White - Female               78
Asian - Male                 70
Asian - Female               18
Native American - Female      4
Native American - Male        4
dtype: int64

In [115]:
# in one line
# normalized to get relative frequency
(emp['race'] + ' - ' + emp['gender']).value_counts(normalize=True).round(3)

White - Male                0.320
Black - Male                0.200
Hispanic - Male             0.180
Black - Female              0.132
Hispanic - Female           0.062
White - Female              0.048
Asian - Male                0.043
Asian - Female              0.011
Native American - Female    0.002
Native American - Male      0.002
dtype: float64

### Exercise 4

<span  style="color:green; font-size:16px">Find the relative frequency of departments for all employees and then find the relative frequency of departments for the top 100 salaries. Compare the differences.</span>

In [116]:
dept_freq = emp['dept'].value_counts(normalize=True)
dept_freq

Houston Police Department-HPD     0.385965
Houston Fire Department (HFD)     0.232305
Public Works & Engineering-PWE    0.207502
Health & Human Services           0.065336
Houston Airport System (HAS)      0.064126
Parks & Recreation                0.044767
Name: dept, dtype: float64

In [117]:
emp_top50 = emp.nlargest(100, 'salary')
emp_top50.head()

,title,dept,salary,race,gender,hire_date
154,"ASSOCIATE EMS PHYSICIAN DIRECTOR,MD",Houston Fire Department (HFD),210588.0,White,Male,2001-09-05
630,DEPUTY DIRECTOR-FINANCE & ADMINISTRATION,Houston Police Department-HPD,199596.0,White,Male,2007-02-01
702,DEPUTY DIRECTOR-AVIATION (EX LVL),Houston Airport System (HAS),186192.0,Black,Male,2013-08-22
8,"CHIEF PHYSICIAN,MD",Health & Human Services,180416.0,Black,Male,1987-05-22
1009,DEPUTY DIRECTOR-PUBLIC WORKS (EXECUTIVE,Public Works & Engineering-PWE,178331.0,White,Female,1991-02-12

In [118]:
dept_freq_top50 = emp_top50['dept'].value_counts(normalize=True)
dept_freq_top50

Public Works & Engineering-PWE    0.31
Houston Police Department-HPD     0.22
Houston Fire Department (HFD)     0.20
Houston Airport System (HAS)      0.17
Health & Human Services           0.08
Parks & Recreation                0.02
Name: dept, dtype: float64

In [119]:
# The police dept makes up 38.5% of employees 
# but only 22% of the top 100 salaries
dept_freq_top50 - dept_freq

Health & Human Services           0.014664
Houston Airport System (HAS)      0.105874
Houston Fire Department (HFD)    -0.032305
Houston Police Department-HPD    -0.165965
Parks & Recreation               -0.024767
Public Works & Engineering-PWE    0.102498
Name: dept, dtype: float64

### Exercise 5

<span  style="color:green; font-size:16px">Create a new column `bonus` right after the salary column equal to 10% of the salary. Round the bonus to the nearest thousand.</span>

In [120]:
bonus = (emp['salary'] * .1).round(-3)
emp.insert(3, 'bonus', bonus)
emp.head()

,title,dept,salary,bonus,race,gender,hire_date
0,POLICE OFFICER,Houston Police Department-HPD,45279.0,5000.0,White,Male,2015-02-03
1,ENGINEER/OPERATOR,Houston Fire Department (HFD),63166.0,6000.0,White,Male,1982-02-08
2,SENIOR POLICE OFFICER,Houston Police Department-HPD,66614.0,7000.0,Black,Male,1984-11-26
3,ENGINEER,Public Works & Engineering-PWE,71680.0,7000.0,Asian,Male,2012-03-26
4,CARPENTER,Houston Airport System (HAS),42390.0,4000.0,White,Male,2013-11-04

### Use the flights dataset for the remaining exercises.

In [121]:
flights = pd.read_csv('../data/flights.csv')
pd.set_option('display.max_columns', 40)
flights.head()

,year,month,day,day_of_week,airline,flight_number,tail_number,origin_airport,destination_airport,scheduled_departure,departure_time,departure_delay,taxi_out,wheels_off,scheduled_time,elapsed_time,air_time,distance,wheels_on,taxi_in,scheduled_arrival,arrival_time,arrival_delay,diverted,cancelled,cancellation_reason,air_system_delay,security_delay,airline_delay,late_aircraft_delay,weather_delay
0,2015,1,1,4,WN,1908,N8324A,LAX,SLC,1625,1723.0,58.0,10.0,1733.0,100.0,107.0,94.0,590,2007.0,3.0,1905,2010.0,65.0,0,0,NaN,31.0,0.0,0.0,34.0,0.0
1,2015,1,1,4,UA,581,N448UA,DEN,IAD,823,830.0,7.0,11.0,841.0,190.0,170.0,154.0,1452,1315.0,5.0,1333,1320.0,-13.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
2,2015,1,1,4,MQ,2851,N645MQ,DFW,VPS,1305,1341.0,36.0,18.0,1359.0,108.0,107.0,85.0,641,1524.0,4.0,1453,1528.0,35.0,0,0,NaN,0.0,0.0,35.0,0.0,0.0
3,2015,1,1,4,AA,383,N3EUAA,DFW,DCA,1555,1602.0,7.0,13.0,1615.0,160.0,146.0,126.0,1192,1921.0,7.0,1935,1928.0,-7.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,2015,1,1,4,WN,3047,N560WN,LAX,MCI,1720,1808.0,48.0,6.0,1814.0,185.0,176.0,166.0,1363,2300.0,4.0,2225,2304.0,39.0,0,0,NaN,0.0,0.0,17.0,22.0,0.0

### Exercise 6

<span  style="color:green; font-size:16px">Find the five variables with the highest correlation to `departure_delay`.</span>

In [122]:
flights.corr().nlargest(6, 'departure_delay')

,year,month,day,day_of_week,flight_number,scheduled_departure,departure_time,departure_delay,taxi_out,wheels_off,scheduled_time,elapsed_time,air_time,distance,wheels_on,taxi_in,scheduled_arrival,arrival_time,arrival_delay,diverted,cancelled,air_system_delay,security_delay,airline_delay,late_aircraft_delay,weather_delay
departure_delay,NaN,-0.010273,-0.001296,-0.010867,-0.021415,0.097870,0.143027,1.000000,0.056017,0.130511,0.030539,0.032522,0.025231,0.028029,-0.013130,0.017020,0.078079,-0.023133,0.943079,0.014899,0.035749,0.043227,0.005982,0.566649,0.614744,0.262567
arrival_delay,NaN,-0.028120,-0.002729,-0.017629,0.010516,0.087381,0.131118,0.943079,0.260143,0.124291,-0.018146,0.042080,0.002777,-0.013538,-0.007764,0.120074,0.073389,-0.017111,1.000000,NaN,NaN,0.226909,0.005134,0.546762,0.580354,0.290796
late_aircraft_delay,NaN,0.021249,0.022794,-0.001918,-0.011046,0.110426,0.146448,0.614744,-0.112953,0.114102,-0.024267,-0.071855,-0.044821,-0.024944,-0.089945,-0.064373,0.064146,-0.093422,0.580354,NaN,NaN,-0.149016,-0.013208,-0.098662,1.000000,-0.010634
airline_delay,NaN,0.009286,-0.004480,0.020719,0.017408,-0.053221,-0.013018,0.566649,-0.097181,-0.019120,0.031116,-0.005039,0.019421,0.027969,-0.055553,-0.049251,-0.042364,-0.051545,0.546762,NaN,NaN,-0.143580,-0.016622,1.000000,-0.098662,-0.069291
weather_delay,NaN,-0.007908,0.029583,-0.039281,0.000365,0.004495,-0.001466,0.262567,0.090456,-0.001796,-0.017605,-0.004823,-0.021089,-0.026772,-0.013280,-0.012330,0.011679,-0.020969,0.290796,NaN,NaN,0.008947,-0.005692,-0.069291,-0.010634,1.000000
departure_time,NaN,-0.000306,-0.005033,-0.000223,0.042582,0.946729,1.000000,0.143027,0.003458,0.959245,-0.098917,-0.100574,-0.099027,-0.099844,0.534003,-0.058068,0.583442,0.501935,0.131118,-0.003364,0.011816,-0.069894,-0.017410,-0.013018,0.146448,-0.001466

### Exercise 7

<span  style="color:green; font-size:16px">Replace the exact string 'LAX' with 'Los Angeles Airport', 'IAH' with 'George Bush Airport', 'SLC' with 'Salt Lake City Airport', and 'UA' with 'United Airlines'.</span>

In [123]:
replace = {'LAX': 'Los Angeles Airport',
           'IAH': 'George Bush Airport',
           'UA': 'United Airlines',
           'SLC': 'Salt Lake City Airport'}
flights.replace(replace).head(8)

,year,month,day,day_of_week,airline,flight_number,tail_number,origin_airport,destination_airport,scheduled_departure,departure_time,departure_delay,taxi_out,wheels_off,scheduled_time,elapsed_time,air_time,distance,wheels_on,taxi_in,scheduled_arrival,arrival_time,arrival_delay,diverted,cancelled,cancellation_reason,air_system_delay,security_delay,airline_delay,late_aircraft_delay,weather_delay
0,2015,1,1,4,WN,1908,N8324A,Los Angeles Airport,Salt Lake City Airport,1625,1723.0,58.0,10.0,1733.0,100.0,107.0,94.0,590,2007.0,3.0,1905,2010.0,65.0,0,0,NaN,31.0,0.0,0.0,34.0,0.0
1,2015,1,1,4,United Airlines,581,N448UA,DEN,IAD,823,830.0,7.0,11.0,841.0,190.0,170.0,154.0,1452,1315.0,5.0,1333,1320.0,-13.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
2,2015,1,1,4,MQ,2851,N645MQ,DFW,VPS,1305,1341.0,36.0,18.0,1359.0,108.0,107.0,85.0,641,1524.0,4.0,1453,1528.0,35.0,0,0,NaN,0.0,0.0,35.0,0.0,0.0
3,2015,1,1,4,AA,383,N3EUAA,DFW,DCA,1555,1602.0,7.0,13.0,1615.0,160.0,146.0,126.0,1192,1921.0,7.0,1935,1928.0,-7.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,2015,1,1,4,WN,3047,N560WN,Los Angeles Airport,MCI,1720,1808.0,48.0,6.0,1814.0,185.0,176.0,166.0,1363,2300.0,4.0,2225,2304.0,39.0,0,0,NaN,0.0,0.0,17.0,22.0,0.0
5,2015,1,1,4,United Airlines,225,N447UA,George Bush Airport,SAN,1450,1451.0,1.0,15.0,1506.0,210.0,195.0,178.0,1303,1604.0,2.0,1620,1606.0,-14.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
6,2015,1,1,4,AA,975,N559AA,DFW,MSY,1250,1414.0,84.0,13.0,1427.0,80.0,79.0,64.0,447,1531.0,2.0,1410,1533.0,83.0,0,0,NaN,0.0,0.0,0.0,83.0,0.0
7,2015,1,1,4,F9,1054,N933FR,SFO,PHX,1020,1013.0,-7.0,18.0,1031.0,115.0,116.0,91.0,651,1302.0,7.0,1315,1309.0,-6.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN

### Exercise 8

<span  style="color:green; font-size:16px">Find the largest departure delay for every airline. Return just these two columns.</span>

In [124]:
cols = ['airline', 'departure_delay']
flights_dd = flights[cols]
flights_dd.sort_values(cols, ascending=[True, False]) \
          .drop_duplicates(subset='airline')

      airline  departure_delay
32218      AA            835.0
8007       AS            338.0
32918      B6            348.0
37448      DL            755.0
18459      EV            672.0
5540       F9            852.0
49971      HA            298.0
29134      MQ            342.0
25433      NK            461.0
42654      OO            735.0
58188      UA           1194.0
25455      US            439.0
9718       VX            253.0
56837      WN            476.0

## 10. Changing Data Types

In [125]:
import pandas as pd, numpy as np

### Exercise 1
<span  style="color:green; font-size:16px">Find the maximum integer of a 16-bit integer. Then verify it with numpys `iinfo` function.</span>

In [126]:
2 ** 15 - 1

32767

In [127]:
np.iinfo('int16')

iinfo(min=-32768, max=32767, dtype=int16)

### Exercise 2
<span  style="color:green; font-size:16px">Read in the bikes data and select the `trip_duration` column. Find its data type and then use the `memory_usage` method to find how much memory (in bytes) it is using. Change its data type to the smallest possible type so that no information is lost. What percentage of memory has been saved?</span>

In [128]:
bikes = pd.read_csv('../data/bikes.csv')
td = bikes['tripduration']
td.head()

0     993
1     623
2    1040
3     667
4     130
Name: tripduration, dtype: int64

In [129]:
td.memory_usage()

400792

Find the min and max values

In [130]:
td.agg(['min', 'max'])

min       60
max    86188
Name: tripduration, dtype: int64

Unfortunately a uint16 doesn't quite have enough memory to fit the max.

In [131]:
np.iinfo('uint16')

iinfo(min=0, max=65535, dtype=uint16)

We need to use 32 bits. Although you can use uint32 its probably best to stick with int32 as this is much more common.

In [132]:
np.iinfo('int32')

iinfo(min=-2147483648, max=2147483647, dtype=int32)

In [133]:
td_32 = td.astype('int32')
td_32.head()

0     993
1     623
2    1040
3     667
4     130
Name: tripduration, dtype: int32

In [134]:
td_32.memory_usage()

200436

We went from using 64 bits for every value to 32 bits. This should yield a decrease of 50% and we verify this below.

In [135]:
td_32.memory_usage() / td.memory_usage()

0.5000998023912653

### Exercise 3
<span  style="color:green; font-size:16px">Use the `randint` function from the numpy `random` module to create 1000 random integers between 1 and 10. Then use this array to create two Series. Name the first `s1` and create it as an 8-bit integer. Name the second `s2` and create it with data type of object. Find the memory used by each Series. Is there a difference?</span>

In [136]:
a = np.random.randint(1, 10, 1000)
s1 = pd.Series(a)
s2 = pd.Series(a, dtype='object')

In [137]:
s1.memory_usage()

8080

In [138]:
s2.memory_usage()

8080

### Exercise 4
<span  style="color:green; font-size:16px">Exercise 3 gave us an incorrect result. The `memory_usage` method doesn't work correctly by default for object data types. You must set the parameter `deep` to `True`. Also, set the `index` parameter to `False` as we are interested in comparing the memory of the values. How many bytes is each value for the different Series?</span>

In [139]:
s1.memory_usage(index=False, deep=True)

8000

In [140]:
s2.memory_usage(index=False, deep=True)

36000

The Series with data type int64 uses 8 bytes per value while the object data type uses 36 bytes per value.

### Exercise 5
<span  style="color:green; font-size:16px">The object Series from exercises 3 and 4 contains regular Python integers. Use the `getsizeof` function from the `sys` module to find the amount of memory of the Python integer 1.</span>

In [141]:
import sys
sys.getsizeof(1)

28

This means that there must be an additional overhead of 8 bytes for each value when creating a numpy array.

### Exercise 6
<span  style="color:green; font-size:16px">Create three different Series with integer data types. Make them have a different number of items. Make a fourth Series that has these three Series as the values. Output the fourth Series. Can you make sense of it?</span>

In [142]:
s1 = pd.Series([1, 2])
s2 = pd.Series([4.3, 2.1, 1.554])
s3 = pd.Series(['python', 'pandas', 'numpy'])
s4 = pd.Series([s1, s2, s3])
s4

0                           0    1
1    2
dtype: int64
1      0    4.300
1    2.100
2    1.554
dtype: float64
2    0    python
1    pandas
2     numpy
dtype: object
dtype: object

It's very hard to decipher what is going on. Series objects are not designed to contain other Series.

### Exercise 7
<span  style="color:green; font-size:16px">What month is it 1 million minutes after the unix epoch?</span>

In [143]:
s = pd.Series([1000000]).astype('datetime64[m]')
s

0   1971-11-26 10:40:00
dtype: datetime64[ns]

In [144]:
s.dt.month_name()

0    November
dtype: object

In the time series part, you will learn how to do this in a more direct manner.

In [145]:
pd.Timestamp(1000000, unit='m').month_name()

'November'

### Exercise 8
<span  style="color:green; font-size:16px">Convert the following Series to float.</span>

In [146]:
s = pd.Series(['1.9', '43', 'python'])
s

0       1.9
1        43
2    python
dtype: object

In [147]:
pd.to_numeric(s, errors='coerce')

0     1.9
1    43.0
2     NaN
dtype: float64

### Exercise 9
<span  style="color:green; font-size:16px">Take a look at the `dpcapacity_start` column from the bikes dataset. It contains the capacity of the bike rack when the ride began. This number should be an integer but it is a float. Why do you think pandas read this in as a float? Do something to the DataFrame as a whole so that you can convert just this column to an integer. Choose the lowest size integer that is possible.</span>

In [148]:
bikes['dpcapacity_start'].head()

0    11.0
1    31.0
2    15.0
3    19.0
4    19.0
Name: dpcapacity_start, dtype: float64

There must be missing values since integers do not contain them.

In [149]:
bikes['dpcapacity_start'].isna().sum()

6

The values easily fit within a 8-bit integer.

In [150]:
bikes['dpcapacity_start'].agg(['min', 'max'])

min     0.0
max    55.0
Name: dpcapacity_start, dtype: float64

Let's drop the missing values just for that column and then convert it to an `int8`.

In [151]:
bikes2 = bikes.dropna(subset=['dpcapacity_start']) \
              .astype({'dpcapacity_start': 'int8'})
bikes2['dpcapacity_start'].head()

0    11
1    31
2    15
3    19
4    19
Name: dpcapacity_start, dtype: int8

### Exercise 10
<span  style="color:green; font-size:16px">pandas recently provided a brand new **nullable integer** data type. It is only available in pandas and not in numpy. You can use it for columns consisting of integers and missing values. You can reference it similarly as the regular integer but with a capital I. For instance, the string `'Int64'` refers to the nullable integer data type with 64 bits. Without dropping values, convert the dpcapacity_start column to a nullable integer with the lowest possible bit size.</span>

In [152]:
bikes_na = bikes.astype({'dpcapacity_start': 'Int8'})
bikes_na['dpcapacity_start'].head()

0    11
1    31
2    15
3    19
4    19
Name: dpcapacity_start, dtype: Int8

Note that this DataFrame has all the rows as the original.

In [153]:
len(bikes), len(bikes2), len(bikes_na)

(50089, 50083, 50089)

## 11. Assigning Subsets of Data

Use the bikes dataset for all of the following exercises.

In [154]:
import pandas as pd
bikes = pd.read_csv('../data/bikes.csv')

### Exercise 1
<span  style="color:green; font-size:16px">Change the values of `events` to 'HEAT WAVE' for all rides where `temperature` is above 95. Verify this by outputting just the `events` and `temperature` columns that meet the condition.</span>

In [155]:
filt = bikes['temperature'] > 95
bikes.loc[filt, 'events'] = 'HEAT WAVE'
bikes.loc[filt, ['temperature', 'events']]

     temperature     events
395         96.1  HEAT WAVE
396         96.1  HEAT WAVE
397         96.1  HEAT WAVE

### Exercise 2
<span  style="color:green; font-size:16px">Increase the trip duration by 50% for all the rides that took place with a wind speed above 40. Output just the trip duration and wind speed before and after the assignment.</span>

In [156]:
filt = bikes['wind_speed'] > 40
cols = ['tripduration', 'wind_speed']
bikes.loc[filt, cols]

       tripduration  wind_speed
22306           130        42.6
22307           528        42.6
22308           358        42.6
22309           221        41.4

In [157]:
bikes.loc[filt, 'tripduration'] *= 1.5
bikes.loc[filt, cols]

       tripduration  wind_speed
22306         195.0        42.6
22307         792.0        42.6
22308         537.0        42.6
22309         331.5        41.4

### Exercise 3
<span  style="color:green; font-size:16px">Change the trip duration for the first two rows to 0.</span>

In [158]:
bikes.iloc[:2, 5] = 0
bikes.head(2)

,trip_id,usertype,gender,starttime,stoptime,tripduration,from_station_name,latitude_start,longitude_start,dpcapacity_start,to_station_name,latitude_end,longitude_end,dpcapacity_end,temperature,visibility,wind_speed,precipitation,events
0,7147,Subscriber,Male,2013-06-28 19:01:00,2013-06-28 19:17:00,0.0,Lake Shore Dr & Monroe St,41.88105,-87.61697,11.0,Michigan Ave & Oak St,41.90096,-87.623777,15.0,73.9,10.0,12.7,-9999.0,mostlycloudy
1,7524,Subscriber,Male,2013-06-28 22:53:00,2013-06-28 23:03:00,0.0,Clinton St & Washington Blvd,41.88338,-87.64117,31.0,Wells St & Walton St,41.89993,-87.634430,19.0,69.1,10.0,6.9,-9999.0,partlycloudy